app/Controllers/AuthController.php

    public function loginAction()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan username
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'april'
 LIMIT 1

    public function registerAction()
    {
        $model = new UserModel();

        $model->save([
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'     => 'customer'
        ]);
---
INSERT INTO `users` (`username`, `password`, `role`) VALUES ('april', '$2y$10$zjS5C9tkRYIkFP.l4DyRD.kzhIa3Fyek.ollMaVGZGmiKxMZ7opL.', 'customer')